In [1]:
#DataFrame和Series的基礎功能
import pandas as pd

obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
#使用reindex()重新新排序索引
obj=obj.reindex(['a', 'b', 'c', 'd'])
obj

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [8]:
import numpy as np
#DataFrame 的reindex()

frame=pd.DataFrame(np.arange(9).reshape((3,3)),
            index=['a', 'c', 'd'],
            columns = ['台北', '台中', '高雄']
            )
frame

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [10]:
#使用reindex()新增row
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

    台北   台中   高雄
a  0.0  1.0  2.0
b  NaN  NaN  NaN
c  3.0  4.0  5.0
d  6.0  7.0  8.0

In [13]:
#使用reindex()移除列
frame3 = frame2.reindex(['a', 'd'])

In [15]:
frame3.reindex(columns=['台中', '台北', '高雄'])

    台中   台北   高雄
a  1.0  0.0  2.0
d  7.0  6.0  8.0

In [16]:
frame3.reindex(columns=['台北','台中'])

    台北   台中
a  0.0  1.0
d  6.0  7.0

In [17]:
#drop()移除列或欄
obj = pd.Series(np.arange(5.),index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [18]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [21]:
new_obj=obj.drop(['d', 'c'])
new_obj

a    0.0
b    1.0
e    4.0
dtype: float64

In [22]:
#dataFrame的drop()
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [23]:
dropData=data.drop(['台北', '台中'])
dropData

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [26]:
data.drop(['two', 'four'], axis=1)

    one  three
台北    0      2
台中    4      6
台南    8     10
高雄   12     14